# SQL Assignment

In [5]:
!wget --header="Host: doc-10-94-docs.googleusercontent.com" --header="User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/81.0.4044.138 Safari/537.36" --header="Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9" --header="Accept-Language: en-US,en;q=0.9" --header="Referer: https://drive.google.com/drive/u/0/my-drive" --header="Cookie: AUTH_qt52u2gu6qban90vehnie4dc20mth5n4=03674084270746528232|1590556950000|10c652n1c9lnn927huknddir6g9s7a02; NID=204=CthYUmtcSUGEmptB0i-VhEmsai6Uu2WP8JzLd-D9gm9nqHbsQ0XHZggFdyO14XYyG0U8Ok4CNZ2FdYQRuT41AV4HFhCCMh1kAxsWMMQsYPUCz2_nUk3WcN4L6YkJRMb0Sj5pEczsVp4F6D4-HXdBT72BFSsVhqakaQW6ba-d-uo" --header="Connection: keep-alive" "https://doc-10-94-docs.googleusercontent.com/docs/securesc/cpqrl8u0bfmm43paalnv6tsqiqd8at9v/l51cjbdk99ij17jli2256bi0ua19goqs/1590557025000/03674084270746528232/03674084270746528232/1cXoix8m_iNzNvd98o90iXf8geWIJMe38?e=download&authuser=0" -c -O 'Db-IMDB-Assignment.db'

--2020-05-27 05:24:38--  https://doc-10-94-docs.googleusercontent.com/docs/securesc/cpqrl8u0bfmm43paalnv6tsqiqd8at9v/l51cjbdk99ij17jli2256bi0ua19goqs/1590557025000/03674084270746528232/03674084270746528232/1cXoix8m_iNzNvd98o90iXf8geWIJMe38?e=download&authuser=0
Resolving doc-10-94-docs.googleusercontent.com (doc-10-94-docs.googleusercontent.com)... 172.217.204.132, 2607:f8b0:400c:c15::84
Connecting to doc-10-94-docs.googleusercontent.com (doc-10-94-docs.googleusercontent.com)|172.217.204.132|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: unspecified [application/octet-stream]
Saving to: ‘Db-IMDB-Assignment.db’

Db-IMDB-Assignment.     [  <=>               ]   7.16M  28.6MB/s    in 0.3s

2020-05-27 05:24:39 (28.6 MB/s) - ‘Db-IMDB-Assignment.db’ saved [7507968]

In [0]:
import pandas as pd
import sqlite3

In [0]:
conn = sqlite3.connect("Db-IMDB-Assignment.db")

## Sample Code

In [8]:
%%time
# Write your sql query below

query = """
        SELECT TRIM(Movie.title) AS 'Movie_Name'
        FROM Movie
        WHERE Movie.rating < 3
        
        """

q = pd.read_sql_query(query, conn)    
print(q.shape)
print(q.head())

(85, 1)
             Movie_Name
0            Mastizaade
1  Dragonball Evolution
2             Loveyatri
3                Race 3
4                Gunday
CPU times: user 12.3 ms, sys: 3.06 ms, total: 15.4 ms
Wall time: 27.4 ms

## Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedy’ and year is a leap year) Your query should return director name, the movie name, and the year.

In [0]:
%%time
# Write your sql query below

query = """
        SELECT p.Name AS Director, m.title AS Movie, CAST(SUBSTR(m.year,-4,4) AS int) AS Year_
        FROM Person p JOIN M_Director md ON md.PID=p.PID
                      JOIN Movie m ON m.MID = md.MID
                      JOIN M_Genre mg ON mg.MID=m.MID
                      JOIN Genre g ON g.GID=mg.GID
        WHERE Year_%4=0 AND g.Name LIKE '%Comedy%'
        ORDER BY Year_ DESC
        """

q1 = pd.read_sql_query(query, conn)    
print(q1.shape)
print(q1.head())

(232, 3)
         Director            Movie  Year_
0    Milap Zaveri       Mastizaade   2016
1    Shakun Batra    Kapoor & Sons   2016
2    Rohit Dhawan          Dishoom   2016
3     Nitya Mehra  Baar Baar Dekho   2016
4   Aditya Chopra          Befikre   2016
CPU times: user 66.8 ms, sys: 0 ns, total: 66.8 ms
Wall time: 67 ms

## Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [0]:
%%time
# Write your sql query below

query = """
        SELECT p.Name AS 'Actor'
        FROM Person p JOIN M_Cast mc ON p.PID=TRIM(mc.PID)
                      JOIN Movie m ON mc.MID=m.MID
        WHERE m.title='Anand' AND m.year=1971
        """

q2 = pd.read_sql_query(query, conn)    
print(q2.shape)
print(q2.head())

(17, 1)
               Actor
0   Amitabh Bachchan
1      Rajesh Khanna
2     Brahm Bhardwaj
3         Ramesh Deo
4          Seema Deo
CPU times: user 151 ms, sys: 5.88 ms, total: 156 ms
Wall time: 160 ms

## Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [0]:
%%time
# Write your sql query below

query = """
        SELECT DISTINCT p.Name AS Actor
        FROM Person p JOIN M_Cast mc ON p.PID=TRIM(mc.PID)
                      JOIN Movie m ON m.MID=mc.MID
        WHERE CAST(SUBSTR(m.year,-4,4) AS int) <1970 AND p.PID IN ( SELECT DISTINCT TRIM(mcc.PID)
                                                                    FROM M_Cast mcc JOIN Movie mm ON mcc.MID=mm.MID
                                                                    WHERE mm.year>1990) 
        GROUP BY Actor
        """

q3 = pd.read_sql_query(query, conn)    
print(q3.shape)
print(q3.head())

(343, 1)
                Actor
0         A.K. Hangal
1      Aachi Manorama
2               Abbas
3               Abdul
4   Abhi Bhattacharya
CPU times: user 305 ms, sys: 12 ms, total: 317 ms
Wall time: 318 ms

## Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [0]:
%%time
# Write your sql query below

query = """
        SELECT p.Name, COUNT(*)
        FROM Person p JOIN M_Director md ON p.PID = md.PID
        GROUP BY p.Name
        HAVING COUNT(*) >= 10
        ORDER BY COUNT(*) DESC
        """

q4 = pd.read_sql_query(query, conn)    
print(q4.shape)
print(q4.head())

(58, 2)
               Name  COUNT(*)
0      David Dhawan        39
1      Mahesh Bhatt        36
2   Ram Gopal Varma        30
3      Priyadarshan        30
4      Vikram Bhatt        29
CPU times: user 32.1 ms, sys: 767 µs, total: 32.9 ms
Wall time: 33 ms

## Q5.a --- For each year, count the number of movies in that year that had only female actors.

In [65]:
%%time
# Write your sql query below

#considering empty genders as female

query = """
        SELECT CAST(SUBSTR(m.year,-4,4) AS int) AS Year_ , COUNT(DISTINCT m.MID) AS Count,  m.title
        FROM Movie m JOIN M_Cast mcc ON m.MID=mcc.MID
        JOIN Person p ON TRIM(mcc.PID) = p.PID
        WHERE NOT EXISTS( SELECT * FROM Person p, M_Cast mc 
                          WHERE m.MID=mc.MID AND TRIM(mc.PID)=p.PID AND p.Gender LIKE 'male') AND mcc.PID IS NOT NULL AND p.Gender IS NOT NULL
        GROUP BY Year_ ORDER BY Year_
        
        """

q5a = pd.read_sql_query(query, conn)  
print(q5a.shape)
print(q5a)

(4, 3)
   Year_  Count       title
0   1939      1  Kala Jigar
1   1999      1   Bindhaast
2   2000      1  Snegithiye
3   2018      1        Pihu
CPU times: user 11.4 s, sys: 868 ms, total: 12.2 s
Wall time: 12.3 s

## Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [75]:
%%time
# Write your sql query below


query = """
        SELECT a.Year_, a.count*100.00/b.count AS Percent, b.count AS 'Total Movies'
        FROM (SELECT CAST(SUBSTR(m.year,-4,4) AS int) AS Year_, COUNT(DISTINCT m.MID) AS count, (SELECT COUNT(DISTINCT Movie.MID) FROM Movie GROUP BY CAST(SUBSTR(Movie.year,-4,4) AS int))
              FROM Movie m  
              JOIN M_Cast mmcc ON m.MID=mmcc.MID
              JOIN Person ppp ON TRIM(mmcc.PID)=ppp.PID
              WHERE NOT EXISTS( SELECT * FROM Person p, M_Cast mc 
                          WHERE m.MID=mc.MID AND TRIM(mc.PID)=p.PID AND p.Gender LIKE 'male' )
                          AND mmcc.PID IS NOT NULL AND ppp.GENDER IS NOT NULL
                          GROUP BY Year_ ) a,
        (SELECT CAST(SUBSTR(kkk.year,-4,4) AS int) AS Year_, COUNT(DISTINCT kkk.MID) AS count FROM Movie kkk GROUP BY Year_) b
        WHERE a.Year_=b.Year_
      
        """

q5b = pd.read_sql_query(query, conn)    
print(q5b.shape)
print(q5b)

(4, 3)
   Year_    Percent  Total Movies
0   1939  50.000000             2
1   1999   1.515152            66
2   2000   1.562500            64
3   2018   0.961538           104
CPU times: user 11.4 s, sys: 876 ms, total: 12.3 s
Wall time: 12.3 s

## Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [0]:
%%time
# Write your sql query below

#Not considering NULL values

query = """
        SELECT m.title as Title, COUNT(DISTINCT mc.PID) as Count
        FROM Movie m JOIN M_Cast mc ON m.MID=mc.MID WHERE mc.PID IS NOT NULL GROUP BY Title ORDER BY Count DESC LIMIT 1
                      
        """

q6 = pd.read_sql_query(query, conn)    
print(q6.shape)
print(q6.head())

(1, 2)
           Title  Count
0  Ocean's Eight    238
CPU times: user 118 ms, sys: 6.05 ms, total: 124 ms
Wall time: 124 ms

## Q7 --- A decade is a sequence of 10 consecutive years. For example, say in your database you have movie information starting from 1965. Then the first decade is 1965, 1966, ..., 1974; the second one is 1967, 1968, ..., 1976 and so on. Find the decade D with the largest number of films and the total number of films in D.

In [0]:
%%time
# Write your sql query below

query = """
        SELECT Decade.year AS Decade, COUNT(*) 
        FROM (SELECT DISTINCT mm.year FROM Movie mm) Decade, Movie m
        WHERE Decade.year<=m.year AND m.year<=Decade.year+10
        GROUP BY Decade.year
        ORDER BY COUNT(*) DESC LIMIT 1
        
        """

q7 = pd.read_sql_query(query, conn)    
print(q7.shape)
print(q7.head())

(1, 2)
  Decade  COUNT(*)
0   2007      1232
CPU times: user 85.2 ms, sys: 11 µs, total: 85.2 ms
Wall time: 86.9 ms

## Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

In [0]:
%%time
# Write your sql query below

query = """
        SELECT entiretable.Actor FROM( 
          SELECT pd.name as Director, pa.Name as Actor, COUNT(*) , RANK() OVER (PARTITION BY pa.PID ORDER BY COUNT(*) DESC) AS Rank_
          FROM M_director d JOIN Person pd ON pd.pid = d.pid 
          JOIN M_cast c ON c.MID = d.MID 
          JOIN Person pa ON pa.PID = TRIM(c.PID) 
          GROUP BY pd.name,pa.name) entiretable
        WHERE entiretable.Director LIKE '%Yash Chopra%' AND entiretable.Rank_=1
        """

q8 = pd.read_sql_query(query, conn)    
print(q8.shape)
print(q8.head())

(243, 1)
             Actor
0    Shashi Kapoor
1      Yash Chopra
2   Akhtar-Ul-Iman
3        Murad Ali
4     Badri Prasad
CPU times: user 540 ms, sys: 18.8 ms, total: 559 ms
Wall time: 564 ms

## Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [0]:
%%time
# Write your sql query below

query = """
        SELECT DISTINCT Z.Name FROM 
                          (SELECT p3.Name AS NAME FROM M_Cast mc3
                          JOIN Person p3 ON TRIM(mc3.PID)=p3.PID
                          WHERE mc3.MID IN(
                            SELECT m2.MID FROM Movie m2
                            JOIN M_Cast mc2 ON m2.MID= mc2.MID
                            WHERE TRIM(mc2.PID) IN
                                      (SELECT TRIM(mc1.PID)
                                      FROM Movie m1
                                      JOIN M_Cast mc1 ON m1.MID =TRIM(mc1.MID)
                                      WHERE mc1.MID IN (
                                              SELECT m.MID 
                                              FROM Movie m                            
                                              JOIN M_Cast mc ON m.MID=mc.MID
                                              JOIN Person p ON TRIM(mc.PID)=p.PID
                                              WHERE p.Name LIKE '%Shah Rukh Khan%' )
                                      GROUP BY mc1.PID)
                            GROUP BY m2.MID)
                            GROUP BY p3.PID)
                            Z
            WHERE Z.Name NOT IN (SELECT p1.Name FROM Person p1
                                      JOIN M_Cast mc1 ON p1.PID =TRIM(mc1.PID)
                                      WHERE mc1.MID IN (
                                              SELECT m.MID 
                                              FROM Movie m                            
                                              JOIN M_Cast mc ON m.MID=mc.MID
                                              JOIN Person p ON TRIM(mc.PID)=p.PID
                                              WHERE p.Name LIKE '%Shah Rukh Khan%' )
                                      GROUP BY mc1.PID)
                            
                            
                            
                      

      
        
     
     
        """

q9 = pd.read_sql_query(query, conn)    
print(q9.shape)
print(q9.head())

(24151, 1)
                NAME
0      Alec Guinness
1       Sophia Loren
2          Brad Pitt
3   Gillian Anderson
4     Pierce Brosnan
CPU times: user 877 ms, sys: 28.9 ms, total: 906 ms
Wall time: 907 ms